; domain
(define (domain pickAndPlace)
    (:types
    ball ball robotArm robotArm room - object
  )
      
    (:requirements 
		:equality
		:existential-preconditions
	)

    (:predicates
        (robotAtRoom ?r - room)
        (ballAtRoom ?b - ball ?r - room)
        (handFree ?h - robotArm)
        (inHand ?b - ball ?h - robotArm)
    )

    (:action pickOneBall
        :parameters (?b1 - ball ?left - robotArm ?right - robotArm ?room - room)
        
        :precondition 
        (and
            (ballAtRoom ?b1 ?room)  
            (robotAtRoom ?room) 
            (handFree ?left) 
            (handFree ?right) 
            (not (inHand ?b1 ?left))
            (not (inHand ?b1 ?right))
        )
        :effect 
        (and 
			(inHand ?b1 ?left) 
			(not (ballAtRoom ?b1 ?room)) 
			(not (handFree ?left))
			(handFree ?right)  
        )
    )

    (:action pickTwoBall
        :parameters (?b1 - ball ?left - robotArm ?b2 - ball ?right - robotArm ?room - room)
        
        :precondition 
        (and 
			(not (= ?b1 ?b2))
            (ballAtRoom ?b1 ?room)
			(ballAtRoom ?b2 ?room)  
            (robotAtRoom ?room) 
            (handFree ?left)
			(handFree ?right) 
            (not (inHand ?b1 ?left))
            (not (inHand ?b2 ?right))
        )
        :effect 
        (and 
			(inHand ?b1 ?left)   
			(not (ballAtRoom ?b1 ?room))    
			(not (handFree ?left))
            (inHand ?b2 ?right)
			(not (ballAtRoom ?b2 ?room))
			(not (handFree ?right))
        )
    )
    
    (:action  placeOneBall
        :parameters (?b1 - ball  ?left - robotArm ?right - robotArm ?room - room)
        
        :precondition 
        (and 
            (not (ballAtRoom ?b1 ?room))
            (handFree ?right)
            (inHand ?b1 ?left) 
            (robotAtRoom ?room)
        )
        :effect 
        (and 
            (handFree ?right)
            (ballAtRoom ?b1 ?room)
            (handFree ?left)  
            (not (inHand ?b1 ?left))
			(not (inHand ?b1 ?right)) 
        )
    )
    
    (:action  placeTwoBall
        :parameters (?b1 - ball ?left - robotArm ?b2 - ball ?right - robotArm ?room - room)
        
        :precondition 
        (and
            (not (ballAtRoom ?b1 ?room))
			(not (= ?b1 ?b2))
			(not (ballAtRoom ?b2 ?room))
            (inHand ?b1 ?left)
            (inHand ?b2 ?right)
            (robotAtRoom ?room)
        )
        :effect 
        (and
			(ballAtRoom ?b1 ?room)
			(handFree ?left)
			(not (inHand ?b1 ?left))
			(ballAtRoom ?b2 ?room)
			(handFree ?right)
			(not (inHand ?b2 ?right))      
        )
    )
    
    (:action move 
        :parameters (?rooma - room ?roomb - room)
        :precondition (robotAtRoom ?rooma)
        :effect (and (robotAtRoom ?roomb) (not (robotAtRoom ?rooma)))
    )
    
)

; problem
(define (problem pickAndPlace_10Balls)

    (:domain pickAndPlace)
    
    (:objects
        rooma roomb - room
        ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 - ball
        left right - robotArm
    )

    (:init  
        (robotAtRoom rooma)
        (handFree left)
        (handFree right)
        (ballAtRoom ball1 rooma)
		(ballAtRoom ball2 rooma)
		(ballAtRoom ball3 rooma) 
		(ballAtRoom ball4 rooma)
		(ballAtRoom ball5 rooma)
		(ballAtRoom ball6 rooma)
		(ballAtRoom ball7 rooma)
		(ballAtRoom ball8 rooma) 
		(ballAtRoom ball9 rooma)
		(ballAtRoom ball10 rooma) 		
    )

    (:goal 
		(and 
			(ballAtRoom ball1 roomb)
			(ballAtRoom ball2 roomb)
			(ballAtRoom ball3 roomb)
			(ballAtRoom ball4 roomb)
			(ballAtRoom ball5 roomb)
            (ballAtRoom ball6 roomb)
			(ballAtRoom ball7 roomb)
			(ballAtRoom ball8 roomb)
			(ballAtRoom ball9 roomb)
			(ballAtRoom ball10 roomb)
		)
    )

)

; plan
1. (picktwoball ball2 right ball1 left rooma)
   deleted: (ballatroom ball2 rooma) (handfree right) (ballatroom ball1 rooma) (handfree left)
   added: (inhand ball2 right) (inhand ball1 left)
   goals met: 0 of 10
2. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 0 of 10
3. (placetwoball ball2 right ball1 left roomb)
   deleted: (inhand ball2 right) (inhand ball1 left)
   added: (ballatroom ball2 roomb) (handfree right) (ballatroom ball1 roomb) (handfree left)
   goals met: 2 of 10
4. (move roomb rooma)
   deleted: (robotatroom roomb)
   added: (robotatroom rooma)
   goals met: 2 of 10
5. (picktwoball ball4 right ball3 left rooma)
   deleted: (ballatroom ball4 rooma) (handfree right) (ballatroom ball3 rooma) (handfree left)
   added: (inhand ball4 right) (inhand ball3 left)
   goals met: 2 of 10
6. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 2 of 10
7. (placetwoball ball4 right ball3 left roomb)
   deleted: (inhand ball4 right) (inhand ball3 left)
   added: (ballatroom ball4 roomb) (handfree right) (ballatroom ball3 roomb) (handfree left)
   goals met: 4 of 10
8. (move roomb rooma)
   deleted: (robotatroom roomb)
   added: (robotatroom rooma)
   goals met: 4 of 10
9. (picktwoball ball6 right ball5 left rooma)
   deleted: (ballatroom ball6 rooma) (handfree right) (ballatroom ball5 rooma) (handfree left)
   added: (inhand ball6 right) (inhand ball5 left)
   goals met: 4 of 10
10. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 4 of 10
11. (placetwoball ball6 right ball5 left roomb)
   deleted: (inhand ball6 right) (inhand ball5 left)
   added: (ballatroom ball6 roomb) (handfree right) (ballatroom ball5 roomb) (handfree left)
   goals met: 6 of 10
12. (move roomb rooma)
   deleted: (robotatroom roomb)
   added: (robotatroom rooma)
   goals met: 6 of 10
13. (picktwoball ball8 right ball7 left rooma)
   deleted: (ballatroom ball8 rooma) (handfree right) (ballatroom ball7 rooma) (handfree left)
   added: (inhand ball8 right) (inhand ball7 left)
   goals met: 6 of 10
14. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 6 of 10
15. (placetwoball ball8 right ball7 left roomb)
   deleted: (inhand ball8 right) (inhand ball7 left)
   added: (ballatroom ball8 roomb) (handfree right) (ballatroom ball7 roomb) (handfree left)
   goals met: 8 of 10
16. (move roomb rooma)
   deleted: (robotatroom roomb)
   added: (robotatroom rooma)
   goals met: 8 of 10
17. (picktwoball ball10 left ball9 right rooma)
   deleted: (ballatroom ball10 rooma) (handfree left) (ballatroom ball9 rooma) (handfree right)
   added: (inhand ball10 left) (inhand ball9 right)
   goals met: 8 of 10
18. (move rooma roomb)
   deleted: (robotatroom rooma)
   added: (robotatroom roomb)
   goals met: 8 of 10
19. (placetwoball ball10 left ball9 right roomb)
   deleted: (inhand ball10 left) (inhand ball9 right)
   added: (ballatroom ball10 roomb) (handfree left) (ballatroom ball9 roomb) (handfree right)
   goals met: 10 of 10
